sgstreet/pi-pico/tools/rp2040-old.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x40008000</baseAddress>
      <interrupt>
        <name>CLOCKS_IRQ</name>
        <value>17</value>
      </interrupt>
      <name>CLOCKS</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock\n
                This can be done at any time</description>
              <name>NUDGE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <description>This delays the enable signal by up to 3 cycles of the input clock\n
                This must be set before the clock is enabled to have any effect</description>
              <name>PHASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Enables duty cycle correction for odd divisors</description>
              <name>DC50</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_rtc</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_GPOUT0_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Fractional component of the divisor</description>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CLK_GPOUT0_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0008</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_GPOUT0_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock\n
                This can be done at any time</description>
              <name>NUDGE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <description>This delays the enable signal by up to 3 cycles of the input clock\n
                This must be set before the clock is enabled to have any effect</description>
              <name>PHASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Enables duty cycle correction for odd divisors</description>
              <name>DC50</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_rtc</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_GPOUT1_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Fractional component of the divisor</description>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CLK_GPOUT1_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0014</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_GPOUT1_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock\n
                This can be done at any time</description>
              <name>NUDGE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <description>This delays the enable signal by up to 3 cycles of the input clock\n
                This must be set before the clock is enabled to have any effect</description>
              <name>PHASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Enables duty cycle correction for odd divisors</description>
              <name>DC50</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_rtc</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_GPOUT2_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Fractional component of the divisor</description>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CLK_GPOUT2_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0020</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_GPOUT2_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0024</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock\n
                This can be done at any time</description>
              <name>NUDGE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <description>This delays the enable signal by up to 3 cycles of the input clock\n
                This must be set before the clock is enabled to have any effect</description>
              <name>PHASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Enables duty cycle correction for odd divisors</description>
              <name>DC50</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_rtc</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_GPOUT3_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0028</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Fractional component of the divisor</description>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CLK_GPOUT3_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x002c</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_GPOUT3_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0030</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[6:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:0]</bitRange>
              <description>Selects the clock source glitchlessly, can be changed on-the-fly</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_clk_ref_aux</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>SRC</name>
            </field>
          </fields>
          <name>CLK_REF_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0034</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
          </fields>
          <name>CLK_REF_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0038</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            The glitchless multiplexer does not switch instantaneously (to avoid glitches), so software should poll this register to wait for the switch to complete. This register contains one decoded bit for each of the clock sources enumerated in the CTRL SRC field. At most one of these bits will be set at any time, indicating that clock is currently present at the output of the glitchless mux. Whilst switching is in progress, this register may briefly show all-0s.</description>
          <name>CLK_REF_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
