sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x007c</addressOffset>
          <description>GPIO control including function select and overrides.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[29:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>don't invert the interrupt</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>invert the interrupt</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive interrupt low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive interrupt high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IRQOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>don't invert the peri input</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>invert the peri input</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive peri input low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive peri input high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>INOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>drive output enable from peripheral signal selected by funcsel</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>disable output</description>
                  <name>DISABLE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>enable output</description>
                  <name>ENABLE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>OEOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>drive output from peripheral signal selected by funcsel</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output from inverse of peripheral signal selected by funcsel</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>OUTOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>0-31 -&gt; selects pin function according to the gpio table\n
                31 == NULL</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>spi1_tx</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart0_rts</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c1_scl</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pwm_b_7</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sio_15</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pio0_15</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pio1_15</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usb_muxing_digital_dp</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usb_muxing_overcurr_detect</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>null</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>FUNCSEL</name>
            </field>
          </fields>
          <name>GPIO15_CTRL</name>
          <resetValue>0x0000001f</resetValue>
        </register>
        <register>
          <addressOffset>0x0080</addressOffset>
          <description>GPIO status</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[26:26]</bitRange>
              <description>interrupt to processors, after override is applied</description>
              <name>IRQTOPROC</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <description>interrupt from pad before override is applied</description>
              <name>IRQFROMPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <description>input signal to peripheral, after override is applied</description>
              <name>INTOPERI</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <description>input signal from pad, before override is applied</description>
              <name>INFROMPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <description>output enable to pad after register override is applied</description>
              <name>OETOPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <description>output enable from selected peripheral, before register override is applied</description>
              <name>OEFROMPERI</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <description>output signal to pad after register override is applied</description>
              <name>OUTTOPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <description>output signal from selected peripheral, before register override is applied</description>
              <name>OUTFROMPERI</name>
            </field>
          </fields>
          <name>GPIO16_STATUS</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0084</addressOffset>
          <description>GPIO control including function select and overrides.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[29:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>don't invert the interrupt</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>invert the interrupt</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive interrupt low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive interrupt high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IRQOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>don't invert the peri input</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>invert the peri input</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive peri input low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive peri input high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>INOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>drive output enable from peripheral signal selected by funcsel</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>disable output</description>
                  <name>DISABLE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>enable output</description>
                  <name>ENABLE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>OEOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>drive output from peripheral signal selected by funcsel</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output from inverse of peripheral signal selected by funcsel</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>OUTOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>0-31 -&gt; selects pin function according to the gpio table\n
                31 == NULL</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>spi0_rx</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart0_tx</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c0_sda</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pwm_a_0</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sio_16</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pio0_16</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pio1_16</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usb_muxing_digital_dm</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usb_muxing_vbus_detect</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>null</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>FUNCSEL</name>
            </field>
          </fields>
          <name>GPIO16_CTRL</name>
          <resetValue>0x0000001f</resetValue>
        </register>
        <register>
          <addressOffset>0x0088</addressOffset>
          <description>GPIO status</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[26:26]</bitRange>
              <description>interrupt to processors, after override is applied</description>
              <name>IRQTOPROC</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <description>interrupt from pad before override is applied</description>
              <name>IRQFROMPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <description>input signal to peripheral, after override is applied</description>
              <name>INTOPERI</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <description>input signal from pad, before override is applied</description>
              <name>INFROMPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <description>output enable to pad after register override is applied</description>
              <name>OETOPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <description>output enable from selected peripheral, before register override is applied</description>
              <name>OEFROMPERI</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <description>output signal to pad after register override is applied</description>
              <name>OUTTOPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <description>output signal from selected peripheral, before register override is applied</description>
              <name>OUTFROMPERI</name>
            </field>
          </fields>
          <name>GPIO17_STATUS</name>
          <resetValue>0x00000000</resetValue>
        </register>
