sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x00e8</addressOffset>
          <description>GPIO status</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[26:26]</bitRange>
              <description>interrupt to processors, after override is applied</description>
              <name>IRQTOPROC</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <description>interrupt from pad before override is applied</description>
              <name>IRQFROMPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <description>input signal to peripheral, after override is applied</description>
              <name>INTOPERI</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <description>input signal from pad, before override is applied</description>
              <name>INFROMPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <description>output enable to pad after register override is applied</description>
              <name>OETOPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <description>output enable from selected peripheral, before register override is applied</description>
              <name>OEFROMPERI</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <description>output signal to pad after register override is applied</description>
              <name>OUTTOPAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <description>output signal from selected peripheral, before register override is applied</description>
              <name>OUTFROMPERI</name>
            </field>
          </fields>
          <name>GPIO29_STATUS</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00ec</addressOffset>
          <description>GPIO control including function select and overrides.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[29:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>don't invert the interrupt</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>invert the interrupt</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive interrupt low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive interrupt high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IRQOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>don't invert the peri input</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>invert the peri input</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive peri input low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive peri input high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>INOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>drive output enable from peripheral signal selected by funcsel</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>disable output</description>
                  <name>DISABLE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>enable output</description>
                  <name>ENABLE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>OEOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>drive output from peripheral signal selected by funcsel</description>
                  <name>NORMAL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output from inverse of peripheral signal selected by funcsel</description>
                  <name>INVERT</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output low</description>
                  <name>LOW</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>drive output high</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>OUTOVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>0-31 -&gt; selects pin function according to the gpio table\n
                31 == NULL</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>spi1_ss_n</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uart0_rx</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c0_scl</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pwm_b_6</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sio_29</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pio0_29</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pio1_29</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>usb_muxing_vbus_en</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>null</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>FUNCSEL</name>
            </field>
          </fields>
          <name>GPIO29_CTRL</name>
          <resetValue>0x0000001f</resetValue>
        </register>
        <register>
          <addressOffset>0x00f0</addressOffset>
          <description>Raw Interrupts</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO7_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO7_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[29:29]</bitRange>
              <name>GPIO7_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[28:28]</bitRange>
              <name>GPIO7_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:27]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO6_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO6_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[25:25]</bitRange>
              <name>GPIO6_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <name>GPIO6_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[23:23]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO5_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO5_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO5_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO5_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO4_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO4_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO4_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO4_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO3_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO3_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO3_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO3_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO2_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO2_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO2_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO2_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO1_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO1_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO1_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO1_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO0_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO0_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO0_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO0_LEVEL_LOW</name>
            </field>
          </fields>
          <name>INTR0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f4</addressOffset>
          <description>Raw Interrupts</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO15_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO15_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[29:29]</bitRange>
              <name>GPIO15_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[28:28]</bitRange>
              <name>GPIO15_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:27]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO14_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO14_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[25:25]</bitRange>
              <name>GPIO14_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <name>GPIO14_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[23:23]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO13_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO13_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO13_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO13_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO12_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO12_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO12_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO12_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO11_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO11_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO11_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO11_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO10_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO10_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO10_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO10_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO9_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO9_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO9_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO9_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO8_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO8_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO8_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO8_LEVEL_LOW</name>
            </field>
          </fields>
          <name>INTR1</name>
          <resetValue>0x00000000</resetValue>
        </register>
