sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x0188</addressOffset>
          <description>Interrupt status after masking &amp; forcing for dormant_wake</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:31]</bitRange>
              <name>GPIO23_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[30:30]</bitRange>
              <name>GPIO23_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[29:29]</bitRange>
              <name>GPIO23_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[28:28]</bitRange>
              <name>GPIO23_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[27:27]</bitRange>
              <name>GPIO22_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[26:26]</bitRange>
              <name>GPIO22_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[25:25]</bitRange>
              <name>GPIO22_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <name>GPIO22_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[23:23]</bitRange>
              <name>GPIO21_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[22:22]</bitRange>
              <name>GPIO21_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO21_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO21_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <name>GPIO20_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[18:18]</bitRange>
              <name>GPIO20_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO20_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO20_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:15]</bitRange>
              <name>GPIO19_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[14:14]</bitRange>
              <name>GPIO19_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO19_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO19_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[11:11]</bitRange>
              <name>GPIO18_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <name>GPIO18_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO18_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO18_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <name>GPIO17_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <name>GPIO17_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO17_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO17_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <name>GPIO16_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <name>GPIO16_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO16_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO16_LEVEL_LOW</name>
            </field>
          </fields>
          <name>DORMANT_WAKE_INTS2</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x018c</addressOffset>
          <description>Interrupt status after masking &amp; forcing for dormant_wake</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[23:23]</bitRange>
              <name>GPIO29_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[22:22]</bitRange>
              <name>GPIO29_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO29_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO29_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <name>GPIO28_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[18:18]</bitRange>
              <name>GPIO28_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO28_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO28_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:15]</bitRange>
              <name>GPIO27_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[14:14]</bitRange>
              <name>GPIO27_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO27_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO27_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[11:11]</bitRange>
              <name>GPIO26_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <name>GPIO26_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO26_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO26_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <name>GPIO25_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <name>GPIO25_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO25_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO25_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <name>GPIO24_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <name>GPIO24_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO24_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO24_LEVEL_LOW</name>
            </field>
          </fields>
          <name>DORMANT_WAKE_INTS3</name>
          <resetValue>0x00000000</resetValue>
        </register>
