sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x0030</addressOffset>
          <description>Raw Interrupts</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:23]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SS_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            </field>
          </fields>
          <name>INTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0034</addressOffset>
          <description>Interrupt Enable for proc0</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:23]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            </field>
          </fields>
          <name>PROC0_INTE</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0038</addressOffset>
          <description>Interrupt Force for proc0</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:23]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            </field>
          </fields>
          <name>PROC0_INTF</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x003c</addressOffset>
          <description>Interrupt status after masking &amp; forcing for proc0</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[23:23]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[22:22]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[18:18]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:15]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[14:14]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[11:11]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            </field>
          </fields>
          <name>PROC0_INTS</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0040</addressOffset>
          <description>Interrupt Enable for proc1</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:23]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[21:21]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:13]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <name>GPIO_QSPI_SS_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            </field>
          </fields>
          <name>PROC1_INTE</name>
          <resetValue>0x00000000</resetValue>
        </register>
