sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x004c</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO18</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0050</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO19</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0054</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO20</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0058</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO21</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x005c</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO22</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0060</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO23</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0064</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO24</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0068</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO25</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x006c</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO26</name>
          <resetValue>0x00000056</resetValue>
        </register>
