sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x0ff8</addressOffset>
          <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[7:0]</bitRange>
              <description>These bits read back as 0x05</description>
              <name>SSPPCELLID2</name>
            </field>
          </fields>
          <name>SSPPCELLID2</name>
          <resetValue>0x00000005</resetValue>
        </register>
        <register>
          <addressOffset>0x0ffc</addressOffset>
          <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[7:0]</bitRange>
              <description>These bits read back as 0xB1</description>
              <name>SSPPCELLID3</name>
            </field>
          </fields>
          <name>SSPPCELLID3</name>
          <resetValue>0x000000b1</resetValue>
        </register>
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <baseAddress>0x40040000</baseAddress>
      <interrupt>
        <name>SPI1_IRQ</name>
        <value>19</value>
      </interrupt>
      <name>SPI1</name>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x0100</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x40044000</baseAddress>
      <description>DW_apb_i2c address block\n\n
        List of configuration constants for the Synopsys I2C hardware (you may see references to these in I2C register header; these are *fixed* values, set at hardware design time):\n\n
        IC_ULTRA_FAST_MODE ................ 0x0\n
        IC_UFM_TBUF_CNT_DEFAULT ........... 0x8\n
        IC_UFM_SCL_LOW_COUNT .............. 0x0008\n
        IC_UFM_SCL_HIGH_COUNT ............. 0x0006\n
        IC_TX_TL .......................... 0x0\n
        IC_TX_CMD_BLOCK ................... 0x1\n
        IC_HAS_DMA ........................ 0x1\n
        IC_HAS_ASYNC_FIFO ................. 0x0\n
        IC_SMBUS_ARP ...................... 0x0\n
        IC_FIRST_DATA_BYTE_STATUS ......... 0x1\n
        IC_INTR_IO ........................ 0x1\n
        IC_MASTER_MODE .................... 0x1\n
        IC_DEFAULT_ACK_GENERAL_CALL ....... 0x1\n
        IC_INTR_POL ....................... 0x1\n
        IC_OPTIONAL_SAR ................... 0x0\n
        IC_DEFAULT_TAR_SLAVE_ADDR ......... 0x055\n
        IC_DEFAULT_SLAVE_ADDR ............. 0x055\n
        IC_DEFAULT_HS_SPKLEN .............. 0x1\n
        IC_FS_SCL_HIGH_COUNT .............. 0x0006\n
        IC_HS_SCL_LOW_COUNT ............... 0x0008\n
        IC_DEVICE_ID_VALUE ................ 0x0\n
        IC_10BITADDR_MASTER ............... 0x0\n
        IC_CLK_FREQ_OPTIMIZATION .......... 0x0\n
        IC_DEFAULT_FS_SPKLEN .............. 0x7\n
        IC_ADD_ENCODED_PARAMS ............. 0x0\n
        IC_DEFAULT_SDA_HOLD ............... 0x000001\n
        IC_DEFAULT_SDA_SETUP .............. 0x64\n
        IC_AVOID_RX_FIFO_FLUSH_ON_TX_ABRT . 0x0\n
        IC_CLOCK_PERIOD ................... 100\n
        IC_EMPTYFIFO_HOLD_MASTER_EN ....... 1\n
        IC_RESTART_EN ..................... 0x1\n
        IC_TX_CMD_BLOCK_DEFAULT ........... 0x0\n
        IC_BUS_CLEAR_FEATURE .............. 0x0\n
        IC_CAP_LOADING .................... 100\n
        IC_FS_SCL_LOW_COUNT ............... 0x000d\n
        APB_DATA_WIDTH .................... 32\n
        IC_SDA_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff\n
        IC_SLV_DATA_NACK_ONLY ............. 0x1\n
        IC_10BITADDR_SLAVE ................ 0x0\n
        IC_CLK_TYPE ....................... 0x0\n
        IC_SMBUS_UDID_MSB ................. 0x0\n
        IC_SMBUS_SUSPEND_ALERT ............ 0x0\n
        IC_HS_SCL_HIGH_COUNT .............. 0x0006\n
        IC_SLV_RESTART_DET_EN ............. 0x1\n
        IC_SMBUS .......................... 0x0\n
        IC_OPTIONAL_SAR_DEFAULT ........... 0x0\n
        IC_PERSISTANT_SLV_ADDR_DEFAULT .... 0x0\n
        IC_USE_COUNTS ..................... 0x0\n
        IC_RX_BUFFER_DEPTH ................ 16\n
        IC_SCL_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff\n
        IC_RX_FULL_HLD_BUS_EN ............. 0x1\n
        IC_SLAVE_DISABLE .................. 0x1\n
        IC_RX_TL .......................... 0x0\n
        IC_DEVICE_ID ...................... 0x0\n
        IC_HC_COUNT_VALUES ................ 0x0\n
        I2C_DYNAMIC_TAR_UPDATE ............ 0\n
        IC_SMBUS_CLK_LOW_MEXT_DEFAULT ..... 0xffffffff\n
        IC_SMBUS_CLK_LOW_SEXT_DEFAULT ..... 0xffffffff\n
        IC_HS_MASTER_CODE ................. 0x1\n
        IC_SMBUS_RST_IDLE_CNT_DEFAULT ..... 0xffff\n
        IC_SMBUS_UDID_LSB_DEFAULT ......... 0xffffffff\n
        IC_SS_SCL_HIGH_COUNT .............. 0x0028\n
        IC_SS_SCL_LOW_COUNT ............... 0x002f\n
        IC_MAX_SPEED_MODE ................. 0x2\n
        IC_STAT_FOR_CLK_STRETCH ........... 0x0\n
        IC_STOP_DET_IF_MASTER_ACTIVE ...... 0x0\n
        IC_DEFAULT_UFM_SPKLEN ............. 0x1\n
        IC_TX_BUFFER_DEPTH ................ 16</description>
      <interrupt>
        <name>I2C0_IRQ</name>
        <value>23</value>
      </interrupt>
      <name>I2C0</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>I2C Control Register. This register can be written only when the DW_apb_i2c is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.\n\n
            Read/Write Access: - bit 10 is read only. - bit 11 is read only - bit 16 is read only - bit 17 is read only - bits 18 and 19 are read only.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <description>Master issues the STOP_DET interrupt irrespective of whether master is active or not</description>
              <name>STOP_DET_IF_MASTER_ACTIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <description>This bit controls whether DW_apb_i2c should hold the bus when the Rx FIFO is physically full to its RX_BUFFER_DEPTH, as described in the IC_RX_FULL_HLD_BUS_EN parameter.\n\n
                Reset value: 0x0.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Overflow when RX_FIFO is full</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Hold bus when RX_FIFO is full</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>RX_FIFO_FULL_HLD_CTRL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <description>This bit controls the generation of the TX_EMPTY interrupt, as described in the IC_RAW_INTR_STAT register.\n\n
                Reset value: 0x0.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Default behaviour of TX_EMPTY interrupt</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Controlled generation of TX_EMPTY interrupt</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>TX_EMPTY_CTRL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>In slave mode: - 1'b1:  issues the STOP_DET interrupt only when it is addressed. - 1'b0:  issues the STOP_DET irrespective of whether it's addressed or not. Reset value: 0x0\n\n
                NOTE: During a general call address, this slave does not issue the STOP_DET interrupt if STOP_DET_IF_ADDRESSED = 1'b1, even if the slave responds to the general call address by generating ACK. The STOP_DET interrupt is generated only when the transmitted address matches the slave address (SAR).</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>slave issues STOP_DET intr always</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>slave issues STOP_DET intr only if addressed</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>STOP_DET_IFADDRESSED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>This bit controls whether I2C has its slave disabled, which means once the presetn signal is applied, then this bit is set and the slave is disabled.\n\n
                If this bit is set (slave is disabled), DW_apb_i2c functions only as a master and does not perform any action that requires a slave.\n\n
                NOTE: Software should ensure that if this bit is written with 0, then bit 0 should also be written with a 0.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Slave mode is enabled</description>
                  <name>SLAVE_ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Slave mode is disabled</description>
                  <name>SLAVE_DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IC_SLAVE_DISABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <description>Determines whether RESTART conditions may be sent when acting as a master. Some older slaves do not support handling RESTART conditions; however, RESTART conditions are used in several DW_apb_i2c operations. When RESTART is disabled, the master is prohibited from performing the following functions: - Sending a START BYTE - Performing any high-speed mode operation - High-speed mode operation - Performing direction changes in combined format mode - Performing a read operation with a 10-bit address By replacing RESTART condition followed by a STOP and a subsequent START condition, split operations are broken down into multiple DW_apb_i2c transfers. If the above operations are performed, it will result in setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT register.\n\n
                Reset value: ENABLED</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Master restart disabled</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Master restart enabled</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IC_RESTART_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Controls whether the DW_apb_i2c starts its transfers in 7- or 10-bit addressing mode when acting as a master. - 0: 7-bit addressing - 1: 10-bit addressing</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Master 7Bit addressing mode</description>
                  <name>ADDR_7BITS</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Master 10Bit addressing mode</description>
                  <name>ADDR_10BITS</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IC_10BITADDR_MASTER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>When acting as a slave, this bit controls whether the DW_apb_i2c responds to 7- or 10-bit addresses. - 0: 7-bit addressing. The DW_apb_i2c ignores transactions that involve 10-bit addressing; for 7-bit addressing, only the lower 7 bits of the IC_SAR register are compared. - 1: 10-bit addressing. The DW_apb_i2c responds to only 10-bit addressing transfers that match the full 10 bits of the IC_SAR register.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Slave 7Bit addressing</description>
                  <name>ADDR_7BITS</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Slave 10Bit addressing</description>
                  <name>ADDR_10BITS</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IC_10BITADDR_SLAVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:1]</bitRange>
              <description>These bits control at which speed the DW_apb_i2c operates; its setting is relevant only if one is operating the DW_apb_i2c in master mode. Hardware protects against illegal values being programmed by software. These bits must be programmed appropriately for slave mode also, as it is used to capture correct value of spike filter as per the speed mode.\n\n
                This register should be programmed only with a value in the range of 1 to IC_MAX_SPEED_MODE; otherwise, hardware updates this register with the value of IC_MAX_SPEED_MODE.\n\n
                1: standard mode (100 kbit/s)\n\n
                2: fast mode (&lt;=400 kbit/s) or fast mode plus (&lt;=1000Kbit/s)\n\n
                3: high speed mode (3.4 Mbit/s)\n\n
                Note: This field is not applicable when IC_ULTRA_FAST_MODE=1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Standard Speed mode of operation</description>
                  <name>STANDARD</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Fast or Fast Plus mode of operation</description>
                  <name>FAST</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>High Speed mode of operation</description>
                  <name>HIGH</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>SPEED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>This bit controls whether the DW_apb_i2c master is enabled.\n\n
                NOTE: Software should ensure that if this bit is written with '1' then bit 6 should also be written with a '1'.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Master mode is disabled</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Master mode is enabled</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>MASTER_MODE</name>
            </field>
          </fields>
          <name>IC_CON</name>
          <resetValue>0x00000065</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>I2C Target Address Register\n\n
            This register is 12 bits wide, and bits 31:12 are reserved. This register can be written to only when IC_ENABLE[0] is set to 0.\n\n
            Note: If the software or application is aware that the DW_apb_i2c is not using the TAR address for the pending commands in the Tx FIFO, then it is possible to update the TAR address even while the Tx FIFO has entries (IC_STATUS[2]= 0). - It is not necessary to perform any write to this register if DW_apb_i2c is enabled as an I2C slave only.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>This bit indicates whether software performs a Device-ID or General Call or START BYTE command. - 0: ignore bit 10 GC_OR_START and use IC_TAR normally - 1: perform special I2C command as specified in Device_ID or GC_OR_START bit Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Disables programming of GENERAL_CALL or START_BYTE transmission</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Enables programming of GENERAL_CALL or START_BYTE transmission</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>SPECIAL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>If bit 11 (SPECIAL) is set to 1 and bit 13(Device-ID) is set to 0, then this bit indicates whether a General Call or START byte command is to be performed by the DW_apb_i2c. - 0: General Call Address - after issuing a General Call, only writes may be performed. Attempting to issue a read command results in setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT register. The DW_apb_i2c remains in General Call mode until the SPECIAL bit value (bit 11) is cleared. - 1: START BYTE Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>GENERAL_CALL byte transmission</description>
                  <name>GENERAL_CALL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>START byte transmission</description>
                  <name>START_BYTE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>GC_OR_START</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:0]</bitRange>
              <description>This is the target address for any master transaction. When transmitting a General Call, these bits are ignored. To generate a START BYTE, the CPU needs to write only once into these bits.\n\n
                If the IC_TAR and IC_SAR are the same, loopback exists but the FIFOs are shared between master and slave, so full loopback is not feasible. Only one direction loopback mode is supported (simplex), not duplex. A master cannot transmit to itself; it can transmit to only a slave.</description>
              <name>IC_TAR</name>
            </field>
          </fields>
          <name>IC_TAR</name>
          <resetValue>0x00000055</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>I2C Slave Address Register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[9:0]</bitRange>
              <description>The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-bit addressing, only IC_SAR[6:0] is used.\n\n
                This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.\n\n
                Note: The default values cannot be any of the reserved address locations: that is, 0x00 to 0x07, or 0x78 to 0x7f. The correct operation of the device is not guaranteed if you program the IC_SAR or IC_TAR to a reserved value. Refer to &lt;&lt;table_I2C_firstbyte_bit_defs&gt;&gt; for a complete list of these reserved values.</description>
              <name>IC_SAR</name>
            </field>
          </fields>
          <name>IC_SAR</name>
          <resetValue>0x00000055</resetValue>
        </register>
