sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x002c</addressOffset>
          <description>I2C Interrupt Status Register\n\n
            Each bit in this register has a corresponding mask bit in the IC_INTR_MASK register. These bits are cleared by reading the matching interrupt clear register. The unmasked raw versions of these bits are available in the IC_RAW_INTR_STAT register.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RESTART_DET bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_RESTART_DET interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_RESTART_DET interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_RESTART_DET</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[11:11]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_GEN_CALL bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_GEN_CALL interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_GEN_CALL interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_GEN_CALL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_START_DET bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_START_DET interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_START_DET interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_START_DET</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_STOP_DET bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_STOP_DET interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_STOP_DET interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_STOP_DET</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_ACTIVITY bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_ACTIVITY interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_ACTIVITY interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_ACTIVITY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_DONE bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_RX_DONE interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_RX_DONE interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_RX_DONE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_ABRT bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_TX_ABRT interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_TX_ABRT interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_TX_ABRT</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RD_REQ bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_RD_REQ interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_RD_REQ interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_RD_REQ</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_EMPTY bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_TX_EMPTY interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_TX_EMPTY interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_TX_EMPTY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_OVER bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_TX_OVER interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_TX_OVER interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_TX_OVER</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_FULL bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_RX_FULL interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_RX_FULL interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_RX_FULL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_OVER bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>R_RX_OVER interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>R_RX_OVER interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_RX_OVER</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_UNDER bit.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>RX_UNDER interrupt is inactive</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>RX_UNDER interrupt is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>R_RX_UNDER</name>
            </field>
          </fields>
          <name>IC_INTR_STAT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0030</addressOffset>
          <description>I2C Interrupt Mask Register.\n\n
            These bits mask their corresponding interrupt status bits. This register is active low; a value of 0 masks the interrupt, whereas a value of 1 unmasks the interrupt.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>This bit masks the R_RESTART_DET interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>RESTART_DET interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>RESTART_DET interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_RESTART_DET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>This bit masks the R_GEN_CALL interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>GEN_CALL interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>GEN_CALL interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_GEN_CALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>This bit masks the R_START_DET interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>START_DET interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>START_DET interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_START_DET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <description>This bit masks the R_STOP_DET interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>STOP_DET interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>STOP_DET interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_STOP_DET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <description>This bit masks the R_ACTIVITY interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>ACTIVITY interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>ACTIVITY interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_ACTIVITY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>This bit masks the R_RX_DONE interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>RX_DONE interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>RX_DONE interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_RX_DONE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>This bit masks the R_TX_ABRT interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>TX_ABORT interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>TX_ABORT interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_TX_ABRT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <description>This bit masks the R_RD_REQ interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>RD_REQ interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>RD_REQ interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_RD_REQ</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>This bit masks the R_TX_EMPTY interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>TX_EMPTY interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>TX_EMPTY interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_TX_EMPTY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>This bit masks the R_TX_OVER interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>TX_OVER interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>TX_OVER interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_TX_OVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>This bit masks the R_RX_FULL interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>RX_FULL interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>RX_FULL interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_RX_FULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>This bit masks the R_RX_OVER interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>RX_OVER interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>RX_OVER interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_RX_OVER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>This bit masks the R_RX_UNDER interrupt in IC_INTR_STAT register.\n\n
                Reset value: 0x1</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>RX_UNDER interrupt is masked</description>
                  <name>ENABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>RX_UNDER interrupt is unmasked</description>
                  <name>DISABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>M_RX_UNDER</name>
            </field>
          </fields>
          <name>IC_INTR_MASK</name>
          <resetValue>0x000008ff</resetValue>
        </register>
