sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x0088</addressOffset>
          <description>DMA Control Register\n\n
            The register is used to enable the DMA Controller interface operation. There is a separate bit for transmit and receive. This can be programmed regardless of the state of IC_ENABLE.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>transmit FIFO DMA channel disabled</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Transmit FIFO DMA channel enabled</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>TDMAE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Receive FIFO DMA channel disabled</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Receive FIFO DMA channel enabled</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>RDMAE</name>
            </field>
          </fields>
          <name>IC_DMA_CR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x008c</addressOffset>
          <description>DMA Transmit Data Level Register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.\n\n
                Reset value: 0x0</description>
              <name>DMATDL</name>
            </field>
          </fields>
          <name>IC_DMA_TDLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0090</addressOffset>
          <description>I2C Receive Data Level Register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or more than this field value + 1, and RDMAE =1. For instance, when DMARDL is 0, then dma_rx_req is asserted when 1 or more data entries are present in the receive FIFO.\n\n
                Reset value: 0x0</description>
              <name>DMARDL</name>
            </field>
          </fields>
          <name>IC_DMA_RDLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0094</addressOffset>
          <description>I2C SDA Setup Register\n\n
            This register controls the amount of time delay (in terms of number of ic_clk clock periods) introduced in the rising edge of SCL - relative to SDA changing - when DW_apb_i2c services a read request in a slave-transmitter operation. The relevant I2C requirement is tSU:DAT (note 4) as detailed in the I2C Bus Specification. This register must be programmed with a value equal to or greater than 2.\n\n
            Writes to this register succeed only when IC_ENABLE[0] = 0.\n\n
            Note: The length of setup time is calculated using [(IC_SDA_SETUP - 1) * (ic_clk_period)], so if the user requires 10 ic_clk periods of setup time, they should program a value of 11. The IC_SDA_SETUP register is only used by the DW_apb_i2c when operating as a slave transmitter.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>SDA Setup. It is recommended that if the required delay is 1000ns, then for an ic_clk frequency of 10 MHz, IC_SDA_SETUP should be programmed to a value of 11. IC_SDA_SETUP must be programmed with a minimum value of 2.</description>
              <name>SDA_SETUP</name>
            </field>
          </fields>
          <name>IC_SDA_SETUP</name>
          <resetValue>0x00000064</resetValue>
        </register>
        <register>
          <addressOffset>0x0098</addressOffset>
          <description>I2C ACK General Call Register\n\n
            The register controls whether DW_apb_i2c responds with a ACK or NACK when it receives an I2C General Call address.\n\n
            This register is applicable only when the DW_apb_i2c is in slave mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>ACK General Call. When set to 1, DW_apb_i2c responds with a ACK (by asserting ic_data_oe) when it receives a General Call. Otherwise, DW_apb_i2c responds with a NACK (by negating ic_data_oe).</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Generate NACK for a General Call</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Generate ACK for a General Call</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ACK_GEN_CALL</name>
            </field>
          </fields>
          <name>IC_ACK_GENERAL_CALL</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x009c</addressOffset>
          <description>I2C Enable Status Register\n\n
            The register is used to report the DW_apb_i2c hardware status when the IC_ENABLE[0] register is set from 1 to 0; that is, when DW_apb_i2c is disabled.\n\n
            If IC_ENABLE[0] has been set to 1, bits 2:1 are forced to 0, and bit 0 is forced to 1.\n\n
            If IC_ENABLE[0] has been set to 0, bits 2:1 is only be valid as soon as bit 0 is read as '0'.\n\n
            Note: When IC_ENABLE[0] has been set to 0, a delay occurs for bit 0 to be read as 0 because disabling the DW_apb_i2c depends on I2C bus activities.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <description>Slave Received Data Lost. This bit indicates if a Slave-Receiver operation has been aborted with at least one data byte received from an I2C transfer due to the setting bit 0 of IC_ENABLE from 1 to 0. When read as 1, DW_apb_i2c is deemed to have been actively engaged in an aborted I2C transfer (with matching address) and the data phase of the I2C transfer has been entered, even though a data byte has been responded with a NACK.\n\n
                Note:  If the remote I2C master terminates the transfer with a STOP condition before the DW_apb_i2c has a chance to NACK a transfer, and IC_ENABLE[0] has been set to 0, then this bit is also set to 1.\n\n
                When read as 0, DW_apb_i2c is deemed to have been disabled without being actively involved in the data phase of a Slave-Receiver transfer.\n\n
                Note:  The CPU can safely read this bit when IC_EN (bit 0) is read as 0.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Slave RX Data is not lost</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Slave RX Data is lost</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>SLV_RX_DATA_LOST</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Slave Disabled While Busy (Transmit, Receive). This bit indicates if a potential or active Slave operation has been aborted due to the setting bit 0 of the IC_ENABLE register from 1 to 0. This bit is set when the CPU writes a 0 to the IC_ENABLE register while:\n\n
                (a) DW_apb_i2c is receiving the address byte of the Slave-Transmitter operation from a remote master;\n\n
                OR,\n\n
                (b) address and data bytes of the Slave-Receiver operation from a remote master.\n\n
                When read as 1, DW_apb_i2c is deemed to have forced a NACK during any part of an I2C transfer, irrespective of whether the I2C address matches the slave address set in DW_apb_i2c (IC_SAR register) OR if the transfer is completed before IC_ENABLE is set to 0 but has not taken effect.\n\n
                Note:  If the remote I2C master terminates the transfer with a STOP condition before the DW_apb_i2c has a chance to NACK a transfer, and IC_ENABLE[0] has been set to 0, then this bit will also be set to 1.\n\n
                When read as 0, DW_apb_i2c is deemed to have been disabled when there is master activity, or when the I2C bus is idle.\n\n
                Note:  The CPU can safely read this bit when IC_EN (bit 0) is read as 0.\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Slave is disabled when it is idle</description>
                  <name>INACTIVE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Slave is disabled when it is active</description>
                  <name>ACTIVE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>SLV_DISABLED_WHILE_BUSY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>ic_en Status. This bit always reflects the value driven on the output port ic_en. - When read as 1, DW_apb_i2c is deemed to be in an enabled state. - When read as 0, DW_apb_i2c is deemed completely inactive. Note:  The CPU can safely read this bit anytime. When this bit is read as 0, the CPU can safely read SLV_RX_DATA_LOST (bit 2) and SLV_DISABLED_WHILE_BUSY (bit 1).\n\n
                Reset value: 0x0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>I2C disabled</description>
                  <name>DISABLED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>I2C enabled</description>
                  <name>ENABLED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>IC_EN</name>
            </field>
          </fields>
          <name>IC_ENABLE_STATUS</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00a0</addressOffset>
          <description>I2C SS, FS or FM+ spike suppression limit\n\n
            This register is used to store the duration, measured in ic_clk cycles, of the longest spike that is filtered out by the spike suppression logic when the component is operating in SS, FS or FM+ modes. The relevant I2C requirement is tSP (table 4) as detailed in the I2C Bus Specification. This register must be programmed with a minimum value of 1.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>This register must be set before any I2C bus transaction can take place to ensure stable operation. This register sets the duration, measured in ic_clk cycles, of the longest spike in the SCL or SDA lines that will be filtered out by the spike suppression logic. This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect. The minimum valid value is 1; hardware prevents values less than this being written, and if attempted results in 1 being set. or more information, refer to 'Spike Suppression'.</description>
              <name>IC_FS_SPKLEN</name>
            </field>
          </fields>
          <name>IC_FS_SPKLEN</name>
          <resetValue>0x00000007</resetValue>
        </register>
        <register>
          <addressOffset>0x00a8</addressOffset>
          <description>Clear RESTART_DET Interrupt Register</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Read this register to clear the RESTART_DET interrupt (bit 12) of IC_RAW_INTR_STAT register.\n\n
                Reset value: 0x0</description>
              <name>CLR_RESTART_DET</name>
            </field>
          </fields>
          <name>IC_CLR_RESTART_DET</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f4</addressOffset>
          <description>Component Parameter Register 1\n\n
            Note This register is not implemented and therefore reads as 0. If it was implemented it would be a constant read-only register that contains encoded information about the component's parameter settings. Fields shown below are the settings for those parameters</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[23:16]</bitRange>
              <description>TX Buffer Depth = 16</description>
              <name>TX_BUFFER_DEPTH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:8]</bitRange>
              <description>RX Buffer Depth = 16</description>
              <name>RX_BUFFER_DEPTH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <description>Encoded parameters not visible</description>
              <name>ADD_ENCODED_PARAMS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <description>DMA handshaking signals are enabled</description>
              <name>HAS_DMA</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <description>COMBINED Interrupt outputs</description>
              <name>INTR_IO</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <description>Programmable count values for each mode.</description>
              <name>HC_COUNT_VALUES</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:2]</bitRange>
              <description>MAX SPEED MODE = FAST MODE</description>
              <name>MAX_SPEED_MODE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:0]</bitRange>
              <description>APB data bus width is 32 bits</description>
              <name>APB_DATA_WIDTH</name>
            </field>
          </fields>
          <name>IC_COMP_PARAM_1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f8</addressOffset>
          <description>I2C Component Version Register</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:0]</bitRange>
              <name>IC_COMP_VERSION</name>
            </field>
          </fields>
          <name>IC_COMP_VERSION</name>
          <resetValue>0x3230312a</resetValue>
        </register>
        <register>
          <addressOffset>0x00fc</addressOffset>
          <description>I2C Component Type Register</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:0]</bitRange>
              <description>Designware Component Type number = 0x44_57_01_40. This assigned unique hex value is constant and is derived from the two ASCII letters 'DW' followed by a 16-bit unsigned number.</description>
              <name>IC_COMP_TYPE</name>
            </field>
          </fields>
          <name>IC_COMP_TYPE</name>
          <resetValue>0x44570140</resetValue>
        </register>
