sgstreet/pi-pico/tools/rp2040-old.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x40058000</baseAddress>
      <name>WATCHDOG</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Watchdog control\n
            The rst_wdsel register determines which subsystems are reset when the watchdog is triggered.\n
            The watchdog can be triggered in software.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Trigger a watchdog reset</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>TRIGGER</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>When not enabled the watchdog timer is paused</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Pause the watchdog timer when processor 1 is in debug mode</description>
              <name>PAUSE_DBG1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Pause the watchdog timer when processor 0 is in debug mode</description>
              <name>PAUSE_DBG0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[24:24]</bitRange>
              <description>Pause the watchdog timer when JTAG is accessing the bus fabric</description>
              <name>PAUSE_JTAG</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[23:0]</bitRange>
              <description>Indicates the number of ticks / 2 (see errata RP2040-E1) before a watchdog reset will be triggered</description>
              <name>TIME</name>
            </field>
          </fields>
          <name>CTRL</name>
          <resetValue>0x07000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Load the watchdog timer. The maximum setting is 0xffffff which corresponds to 0xffffff / 2 ticks before triggering a watchdog reset (see errata RP2040-E1).</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[23:0]</bitRange>
              <name>LOAD</name>
            </field>
          </fields>
          <name>LOAD</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>Logs the reason for the last reset. Both bits are zero for the case of a hardware reset.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>FORCE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>TIMER</name>
            </field>
          </fields>
          <name>REASON</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x000c</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0010</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0014</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH2</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0018</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH3</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x001c</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH4</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0020</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH5</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0024</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH6</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0028</addressOffset>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <name>SCRATCH7</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x002c</addressOffset>
          <description>Controls the tick generator</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[19:11]</bitRange>
              <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
              <name>COUNT</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <description>Is the tick generator running?</description>
              <name>RUNNING</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <description>start / stop tick generation</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:0]</bitRange>
              <description>Total number of clk_tick cycles before the next tick.</description>
              <name>CYCLES</name>
            </field>
          </fields>
          <name>TICK</name>
          <resetValue>0x00000200</resetValue>
        </register>
