sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x020c</addressOffset>
          <description>DMA Channel 8 Control and Status</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:31]</bitRange>
              <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
              <name>AHB_ERROR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>If 1, the channel received a read bus error. Write one to clear.\n
                READ_ADDR shows the approximate address where the bus error was encountered (will not to be earlier, or more than 3 transfers later)</description>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>READ_ERROR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>If 1, the channel received a write bus error. Write one to clear.\n
                WRITE_ADDR shows the approximate address where the bus error was encountered (will not to be earlier, or more than 5 transfers later)</description>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>WRITE_ERROR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.\n\n
                To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
              <name>BUSY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[23:23]</bitRange>
              <description>If 1, this channel's data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.\n\n
                This allows checksum to be enabled or disabled on a per-control- block basis.</description>
              <name>SNIFF_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <description>Apply byte-swap transformation to DMA data.\n
                For byte data, this has no effect. For halfword data, the two bytes of each halfword are swapped. For word data, the four bytes of each word are swapped to reverse order.</description>
              <name>BSWAP</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[21:21]</bitRange>
              <description>In QUIET mode, the channel does not generate IRQs at the end of every transfer block. Instead, an IRQ is raised when NULL is written to a trigger register, indicating the end of a control block chain.\n\n
                This reduces the number of interrupts to be serviced by the CPU when transferring a DMA chain of many small control blocks.</description>
              <name>IRQ_QUIET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:15]</bitRange>
              <description>Select a Transfer Request signal.\n
                The channel uses the transfer request signal to pace its data transfer rate. Sources for TREQ signals are internal (TIMERS) or external (DREQ, a Data Request from the system).\n
                0x0 to 0x3a -&gt; select DREQ n as TREQ</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Select Timer 0 as TREQ</description>
                  <name>TIMER0</name>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Select Timer 1 as TREQ</description>
                  <name>TIMER1</name>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Select Timer 2 as TREQ (Optional)</description>
                  <name>TIMER2</name>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Select Timer 3 as TREQ (Optional)</description>
                  <name>TIMER3</name>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Permanent request, for unpaced transfers.</description>
                  <name>PERMANENT</name>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>TREQ_SEL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:11]</bitRange>
              <description>When this channel completes, it will trigger the channel indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_.</description>
              <name>CHAIN_TO</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Select whether RING_SIZE applies to read or write addresses.\n
                If 0, read addresses are wrapped on a (1 &lt;&lt; RING_SIZE) boundary. If 1, write addresses are wrapped.</description>
              <name>RING_SEL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:6]</bitRange>
              <description>Size of address wrap region. If 0, don't wrap. For values n &gt; 0, only the lower n bits of the address will change. This wraps the address on a (1 &lt;&lt; n) byte boundary, facilitating access to naturally-aligned ring buffers.\n\n
                Ring sizes between 2 and 32768 bytes are possible. This can apply to either read or write addresses, based on value of RING_SEL.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RING_NONE</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>RING_SIZE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <description>If 1, the write address increments with each transfer. If 0, each write is directed to the same, initial address.\n\n
                Generally this should be disabled for memory-to-peripheral transfers.</description>
              <name>INCR_WRITE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.\n\n
                Generally this should be disabled for peripheral-to-memory transfers.</description>
              <name>INCR_READ</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:2]</bitRange>
              <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_BYTE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_HALFWORD</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_WORD</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DATA_SIZE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.\n\n
                This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
              <name>HIGH_PRIORITY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>DMA Channel Enable.\n
                When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
              <name>EN</name>
            </field>
          </fields>
          <name>CH8_CTRL_TRIG</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0210</addressOffset>
          <description>Alias for channel 8 CTRL register</description>
          <name>CH8_AL1_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0214</addressOffset>
          <description>Alias for channel 8 READ_ADDR register</description>
          <name>CH8_AL1_READ_ADDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0218</addressOffset>
          <description>Alias for channel 8 WRITE_ADDR register</description>
          <name>CH8_AL1_WRITE_ADDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x021c</addressOffset>
          <description>Alias for channel 8 TRANS_COUNT register\n
            This is a trigger register (0xc). Writing a nonzero value will\n
            reload the channel counter and start the channel.</description>
          <name>CH8_AL1_TRANS_COUNT_TRIG</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0220</addressOffset>
          <description>Alias for channel 8 CTRL register</description>
          <name>CH8_AL2_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0224</addressOffset>
          <description>Alias for channel 8 TRANS_COUNT register</description>
          <name>CH8_AL2_TRANS_COUNT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0228</addressOffset>
          <description>Alias for channel 8 READ_ADDR register</description>
          <name>CH8_AL2_READ_ADDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x022c</addressOffset>
          <description>Alias for channel 8 WRITE_ADDR register\n
            This is a trigger register (0xc). Writing a nonzero value will\n
            reload the channel counter and start the channel.</description>
          <name>CH8_AL2_WRITE_ADDR_TRIG</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0230</addressOffset>
          <description>Alias for channel 8 CTRL register</description>
          <name>CH8_AL3_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0234</addressOffset>
          <description>Alias for channel 8 WRITE_ADDR register</description>
          <name>CH8_AL3_WRITE_ADDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0238</addressOffset>
          <description>Alias for channel 8 TRANS_COUNT register</description>
          <name>CH8_AL3_TRANS_COUNT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x023c</addressOffset>
          <description>Alias for channel 8 READ_ADDR register\n
            This is a trigger register (0xc). Writing a nonzero value will\n
            reload the channel counter and start the channel.</description>
          <name>CH8_AL3_READ_ADDR_TRIG</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0240</addressOffset>
          <description>DMA Channel 9 Read Address pointer\n
            This register updates automatically each time a read completes. The current value is the next address to be read by this channel.</description>
          <name>CH9_READ_ADDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0244</addressOffset>
          <description>DMA Channel 9 Write Address pointer\n
            This register updates automatically each time a write completes. The current value is the next address to be written by this channel.</description>
          <name>CH9_WRITE_ADDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0248</addressOffset>
          <description>DMA Channel 9 Transfer Count\n
            Program the number of bus transfers a channel will perform before halting. Note that, if transfers are larger than one byte in size, this is not equal to the number of bytes transferred (see CTRL_DATA_SIZE).\n\n
            When the channel is active, reading this register shows the number of transfers remaining, updating automatically each time a write transfer completes.\n\n
            Writing this register sets the RELOAD value for the transfer counter. Each time this channel is triggered, the RELOAD value is copied into the live transfer counter. The channel can be started multiple times, and will perform the same number of transfers each time, as programmed by most recent write.\n\n
            The RELOAD value can be observed at CHx_DBG_TCR. If TRANS_COUNT is used as a trigger, the written value is used immediately as the length of the new transfer sequence, as well as being written to RELOAD.</description>
          <name>CH9_TRANS_COUNT</name>
          <resetValue>0x00000000</resetValue>
        </register>
