sgstreet/pi-pico/tools/rp2040-old.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x0100</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x50100000</baseAddress>
      <description>DPRAM layout for USB device.</description>
      <name>USBCTRL_DPRAM</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Bytes 0-3 of the SETUP packet from the host.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <name>WVALUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:8]</bitRange>
              <name>BREQUEST</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <name>BMREQUESTTYPE</name>
            </field>
          </fields>
          <name>SETUP_PACKET_LOW</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Bytes 4-7 of the setup packet from the host.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <name>WLENGTH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>WINDEX</name>
            </field>
          </fields>
          <name>SETUP_PACKET_HIGH</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>This endpoint is double buffered.</description>
              <name>DOUBLE_BUFFERED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Trigger an interrupt each time a buffer is done.</description>
              <name>INTERRUPT_PER_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
              <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Control</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Isochronous</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bulk</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENDPOINT_TYPE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
              <name>BUFFER_ADDRESS</name>
            </field>
          </fields>
          <name>EP1_IN_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>This endpoint is double buffered.</description>
              <name>DOUBLE_BUFFERED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Trigger an interrupt each time a buffer is done.</description>
              <name>INTERRUPT_PER_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
              <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Control</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Isochronous</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bulk</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENDPOINT_TYPE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
              <name>BUFFER_ADDRESS</name>
            </field>
          </fields>
          <name>EP1_OUT_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>This endpoint is double buffered.</description>
              <name>DOUBLE_BUFFERED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Trigger an interrupt each time a buffer is done.</description>
              <name>INTERRUPT_PER_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
              <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Control</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Isochronous</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bulk</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENDPOINT_TYPE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
              <name>BUFFER_ADDRESS</name>
            </field>
          </fields>
          <name>EP2_IN_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0014</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>This endpoint is double buffered.</description>
              <name>DOUBLE_BUFFERED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Trigger an interrupt each time a buffer is done.</description>
              <name>INTERRUPT_PER_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
              <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Control</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Isochronous</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bulk</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENDPOINT_TYPE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
              <name>BUFFER_ADDRESS</name>
            </field>
          </fields>
          <name>EP2_OUT_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>This endpoint is double buffered.</description>
              <name>DOUBLE_BUFFERED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Trigger an interrupt each time a buffer is done.</description>
              <name>INTERRUPT_PER_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
              <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Control</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Isochronous</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bulk</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENDPOINT_TYPE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
              <name>BUFFER_ADDRESS</name>
            </field>
          </fields>
          <name>EP3_IN_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>This endpoint is double buffered.</description>
              <name>DOUBLE_BUFFERED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Trigger an interrupt each time a buffer is done.</description>
              <name>INTERRUPT_PER_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
              <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Control</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Isochronous</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bulk</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENDPOINT_TYPE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
              <name>BUFFER_ADDRESS</name>
            </field>
          </fields>
          <name>EP3_OUT_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0020</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>This endpoint is double buffered.</description>
              <name>DOUBLE_BUFFERED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Trigger an interrupt each time a buffer is done.</description>
              <name>INTERRUPT_PER_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
              <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Control</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Isochronous</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bulk</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENDPOINT_TYPE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
              <name>INTERRUPT_ON_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
              <name>BUFFER_ADDRESS</name>
            </field>
          </fields>
          <name>EP4_IN_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
