sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x00fc</addressOffset>
          <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1.\n
            Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Buffer 1 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
              <name>FULL_1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>Buffer 1 is the last buffer of the transfer.</description>
              <name>LAST_1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>The data pid of buffer 1.</description>
              <name>PID_1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:27]</bitRange>
              <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint.\n
                For a non Isochronous endpoint the offset is always 64 bytes.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DOUBLE_BUFFER_ISO_OFFSET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
              <name>AVAILABLE_1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:16]</bitRange>
              <description>The length of the data in buffer 1.</description>
              <name>LENGTH_1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>Buffer 0 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
              <name>FULL_0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <description>Buffer 0 is the last buffer of the transfer.</description>
              <name>LAST_0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:13]</bitRange>
              <description>The data pid of buffer 0.</description>
              <name>PID_0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Reset the buffer selector to buffer 0.</description>
              <name>RESET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Reply with a stall (valid for both buffers).</description>
              <name>STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
              <name>AVAILABLE_0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:0]</bitRange>
              <description>The length of the data in buffer 0.</description>
              <name>LENGTH_0</name>
            </field>
          </fields>
          <name>EP15_OUT_BUFFER_CONTROL</name>
          <resetValue>0x00000000</resetValue>
        </register>
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x50110000</baseAddress>
      <description>USB FS/LS controller device registers</description>
      <interrupt>
        <name>USBCTRL_IRQ</name>
        <value>5</value>
      </interrupt>
      <name>USBCTRL_REGS</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Device address and endpoint control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Device endpoint to send data to. Only valid for HOST mode.</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>In device mode, the address that the device should respond to. Set in response to a SET_ADDR setup packet from the host. In host mode set to the address of the device to communicate with.</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Interrupt endpoint 1. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>Interrupt endpoint 2. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP2</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <description>Interrupt endpoint 3. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP3</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <description>Interrupt endpoint 4. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP4</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0014</addressOffset>
          <description>Interrupt endpoint 5. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP5</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <description>Interrupt endpoint 6. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP6</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>Interrupt endpoint 7. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP7</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0020</addressOffset>
          <description>Interrupt endpoint 8. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP8</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0024</addressOffset>
          <description>Interrupt endpoint 9. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP9</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0028</addressOffset>
          <description>Interrupt endpoint 10. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP10</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x002c</addressOffset>
          <description>Interrupt endpoint 11. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP11</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0030</addressOffset>
          <description>Interrupt endpoint 12. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP12</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0034</addressOffset>
          <description>Interrupt endpoint 13. Only valid for HOST mode.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <name>INTEP_PREAMBLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <name>INTEP_DIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:16]</bitRange>
              <description>Endpoint number of the interrupt endpoint</description>
              <name>ENDPOINT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:0]</bitRange>
              <description>Device address</description>
              <name>ADDRESS</name>
            </field>
          </fields>
          <name>ADDR_ENDP13</name>
          <resetValue>0x00000000</resetValue>
        </register>
