sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0x00ac</addressOffset>
          <description>Control register for lane 0</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[25:25]</bitRange>
              <description>Set if either OVERF0 or OVERF1 is set.</description>
              <name>OVERF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
              <name>OVERF1</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[23:23]</bitRange>
              <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
              <name>OVERF0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[21:21]</bitRange>
              <description>Only present on INTERP0 on each core. If BLEND mode is enabled:\n
                - LANE1 result is a linear interpolation between BASE0 and BASE1, controlled\n
                by the 8 LSBs of lane 1 shift and mask value (a fractional number between\n
                0 and 255/256ths)\n
                - LANE0 result does not have BASE0 added (yields only the 8 LSBs of lane 1 shift+mask value)\n
                - FULL result does not have lane 1 shift+mask value added (BASE2 + lane 0 shift+mask)\n
                LANE1 SIGNED flag controls whether the interpolation is signed or unsigned.</description>
              <name>BLEND</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:19]</bitRange>
              <description>ORed into bits 29:28 of the lane result presented to the processor on the bus.\n
                No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence\n
                of pointers into flash or SRAM.</description>
              <name>FORCE_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
              <name>ADD_RAW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
              <name>CROSS_RESULT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware.\n
                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
              <name>CROSS_INPUT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits\n
                before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor.</description>
              <name>SIGNED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:10]</bitRange>
              <description>The most-significant bit allowed to pass by the mask (inclusive)\n
                Setting MSB &lt; LSB may cause chip to turn inside-out</description>
              <name>MASK_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:5]</bitRange>
              <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
              <name>MASK_LSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>Logical right-shift applied to accumulator before masking</description>
              <name>SHIFT</name>
            </field>
          </fields>
          <name>INTERP0_CTRL_LANE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00b0</addressOffset>
          <description>Control register for lane 1</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:19]</bitRange>
              <description>ORed into bits 29:28 of the lane result presented to the processor on the bus.\n
                No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence\n
                of pointers into flash or SRAM.</description>
              <name>FORCE_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>If 1, mask + shift is bypassed for LANE1 result. This does not affect FULL result.</description>
              <name>ADD_RAW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
              <name>CROSS_RESULT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware.\n
                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
              <name>CROSS_INPUT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits\n
                before adding to BASE1, and LANE1 PEEK/POP appear extended to 32 bits when read by processor.</description>
              <name>SIGNED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:10]</bitRange>
              <description>The most-significant bit allowed to pass by the mask (inclusive)\n
                Setting MSB &lt; LSB may cause chip to turn inside-out</description>
              <name>MASK_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:5]</bitRange>
              <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
              <name>MASK_LSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>Logical right-shift applied to accumulator before masking</description>
              <name>SHIFT</name>
            </field>
          </fields>
          <name>INTERP0_CTRL_LANE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00b4</addressOffset>
          <description>Values written here are atomically added to ACCUM0\n
            Reading yields lane 0's raw shift and mask value (BASE0 not added).</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:0]</bitRange>
              <name>INTERP0_ACCUM0_ADD</name>
            </field>
          </fields>
          <name>INTERP0_ACCUM0_ADD</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00b8</addressOffset>
          <description>Values written here are atomically added to ACCUM1\n
            Reading yields lane 1's raw shift and mask value (BASE1 not added).</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:0]</bitRange>
              <name>INTERP0_ACCUM1_ADD</name>
            </field>
          </fields>
          <name>INTERP0_ACCUM1_ADD</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>write-only</access>
          <addressOffset>0x00bc</addressOffset>
          <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously.\n
            Each half is sign-extended to 32 bits if that lane's SIGNED flag is set.</description>
          <name>INTERP0_BASE_1AND0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x00c0</addressOffset>
          <description>Read/write access to accumulator 0</description>
          <name>INTERP1_ACCUM0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x00c4</addressOffset>
          <description>Read/write access to accumulator 1</description>
          <name>INTERP1_ACCUM1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x00c8</addressOffset>
          <description>Read/write access to BASE0 register.</description>
          <name>INTERP1_BASE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x00cc</addressOffset>
          <description>Read/write access to BASE1 register.</description>
          <name>INTERP1_BASE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x00d0</addressOffset>
          <description>Read/write access to BASE2 register.</description>
          <name>INTERP1_BASE2</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00d4</addressOffset>
          <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
          <name>INTERP1_POP_LANE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00d8</addressOffset>
          <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
          <name>INTERP1_POP_LANE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00dc</addressOffset>
          <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
          <name>INTERP1_POP_FULL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00e0</addressOffset>
          <description>Read LANE0 result, without altering any internal state (PEEK).</description>
          <name>INTERP1_PEEK_LANE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00e4</addressOffset>
          <description>Read LANE1 result, without altering any internal state (PEEK).</description>
          <name>INTERP1_PEEK_LANE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00e8</addressOffset>
          <description>Read FULL result, without altering any internal state (PEEK).</description>
          <name>INTERP1_PEEK_FULL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00ec</addressOffset>
          <description>Control register for lane 0</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[25:25]</bitRange>
              <description>Set if either OVERF0 or OVERF1 is set.</description>
              <name>OVERF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[24:24]</bitRange>
              <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
              <name>OVERF1</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[23:23]</bitRange>
              <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
              <name>OVERF0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:22]</bitRange>
              <description>Only present on INTERP1 on each core. If CLAMP mode is enabled:\n
                - LANE0 result is shifted and masked ACCUM0, clamped by a lower bound of\n
                BASE0 and an upper bound of BASE1.\n
                - Signedness of these comparisons is determined by LANE0_CTRL_SIGNED</description>
              <name>CLAMP</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:19]</bitRange>
              <description>ORed into bits 29:28 of the lane result presented to the processor on the bus.\n
                No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence\n
                of pointers into flash or SRAM.</description>
              <name>FORCE_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
              <name>ADD_RAW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
              <name>CROSS_RESULT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware.\n
                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
              <name>CROSS_INPUT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits\n
                before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor.</description>
              <name>SIGNED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:10]</bitRange>
              <description>The most-significant bit allowed to pass by the mask (inclusive)\n
                Setting MSB &lt; LSB may cause chip to turn inside-out</description>
              <name>MASK_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:5]</bitRange>
              <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
              <name>MASK_LSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>Logical right-shift applied to accumulator before masking</description>
              <name>SHIFT</name>
            </field>
          </fields>
          <name>INTERP1_CTRL_LANE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f0</addressOffset>
          <description>Control register for lane 1</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:19]</bitRange>
              <description>ORed into bits 29:28 of the lane result presented to the processor on the bus.\n
                No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence\n
                of pointers into flash or SRAM.</description>
              <name>FORCE_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>If 1, mask + shift is bypassed for LANE1 result. This does not affect FULL result.</description>
              <name>ADD_RAW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
              <name>CROSS_RESULT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware.\n
                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
              <name>CROSS_INPUT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits\n
                before adding to BASE1, and LANE1 PEEK/POP appear extended to 32 bits when read by processor.</description>
              <name>SIGNED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:10]</bitRange>
              <description>The most-significant bit allowed to pass by the mask (inclusive)\n
                Setting MSB &lt; LSB may cause chip to turn inside-out</description>
              <name>MASK_MSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:5]</bitRange>
              <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
              <name>MASK_LSB</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>Logical right-shift applied to accumulator before masking</description>
              <name>SHIFT</name>
            </field>
          </fields>
          <name>INTERP1_CTRL_LANE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f4</addressOffset>
          <description>Values written here are atomically added to ACCUM0\n
            Reading yields lane 0's raw shift and mask value (BASE0 not added).</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:0]</bitRange>
              <name>INTERP1_ACCUM0_ADD</name>
            </field>
          </fields>
          <name>INTERP1_ACCUM0_ADD</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f8</addressOffset>
          <description>Values written here are atomically added to ACCUM1\n
            Reading yields lane 1's raw shift and mask value (BASE1 not added).</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:0]</bitRange>
              <name>INTERP1_ACCUM1_ADD</name>
            </field>
          </fields>
          <name>INTERP1_ACCUM1_ADD</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>write-only</access>
          <addressOffset>0x00fc</addressOffset>
          <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously.\n
            Each half is sign-extended to 32 bits if that lane's SIGNED flag is set.</description>
          <name>INTERP1_BASE_1AND0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0100</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0104</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0108</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK2</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x010c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK3</name>
          <resetValue>0x00000000</resetValue>
        </register>
