sgstreet/pi-pico/tools/rp2040-old.svd
        <register>
          <addressOffset>0xed04</addressOffset>
          <description>Use the Interrupt Control State Register to set a pending Non-Maskable Interrupt (NMI), set or clear a pending PendSV, set or clear a pending SysTick, check for pending exceptions, check the vector number of the highest priority pended exception, check the vector number of the active exception.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Setting this bit will activate an NMI. Since NMI is the highest priority exception, it will activate as soon as it is registered.\n
                NMI set-pending bit.\n
                Write:\n
                0 = No effect.\n
                1 = Changes NMI exception state to pending.\n
                Read:\n
                0 = NMI exception is not pending.\n
                1 = NMI exception is pending.\n
                Because NMI is the highest-priority exception, normally the processor enters the NMI\n
                exception handler as soon as it detects a write of 1 to this bit. Entering the handler then clears\n
                this bit to 0. This means a read of this bit by the NMI exception handler returns 1 only if the\n
                NMI signal is reasserted while the processor is executing that handler.</description>
              <name>NMIPENDSET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>PendSV set-pending bit.\n
                Write:\n
                0 = No effect.\n
                1 = Changes PendSV exception state to pending.\n
                Read:\n
                0 = PendSV exception is not pending.\n
                1 = PendSV exception is pending.\n
                Writing 1 to this bit is the only way to set the PendSV exception state to pending.</description>
              <name>PENDSVSET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[27:27]</bitRange>
              <description>PendSV clear-pending bit.\n
                Write:\n
                0 = No effect.\n
                1 = Removes the pending state from the PendSV exception.</description>
              <name>PENDSVCLR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>SysTick exception set-pending bit.\n
                Write:\n
                0 = No effect.\n
                1 = Changes SysTick exception state to pending.\n
                Read:\n
                0 = SysTick exception is not pending.\n
                1 = SysTick exception is pending.</description>
              <name>PENDSTSET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>SysTick exception clear-pending bit.\n
                Write:\n
                0 = No effect.\n
                1 = Removes the pending state from the SysTick exception.\n
                This bit is WO. On a register read its value is Unknown.</description>
              <name>PENDSTCLR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[23:23]</bitRange>
              <description>The system can only access this bit when the core is halted. It indicates that a pending interrupt is to be taken in the next running cycle. If C_MASKINTS is clear in the Debug Halting Control and Status Register, the interrupt is serviced.</description>
              <name>ISRPREEMPT</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[22:22]</bitRange>
              <description>External interrupt pending flag</description>
              <name>ISRPENDING</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:12]</bitRange>
              <description>Indicates the exception number for the highest priority pending exception: 0 = no pending exceptions. Non zero = The pending state includes the effect of memory-mapped enable and mask registers. It does not include the PRIMASK special-purpose register qualifier.</description>
              <name>VECTPENDING</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:0]</bitRange>
              <description>Active exception number field. Reset clears the VECTACTIVE field.</description>
              <name>VECTACTIVE</name>
            </field>
          </fields>
          <name>ICSR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed08</addressOffset>
          <description>The VTOR holds the vector table offset address.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Bits [31:8] of the indicate the vector table offset address.</description>
              <name>TBLOFF</name>
            </field>
          </fields>
          <name>VTOR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed0c</addressOffset>
          <description>Use the Application Interrupt and Reset Control Register to: determine data endianness, clear all active state information from debug halt mode, request a system reset.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <description>Register key:\n
                Reads as Unknown\n
                On writes, write 0x05FA to VECTKEY, otherwise the write is ignored.</description>
              <name>VECTKEY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:15]</bitRange>
              <description>Data endianness implemented:\n
                0 = Little-endian.</description>
              <name>ENDIANESS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Writing 1 to this bit causes the SYSRESETREQ signal to the outer system to be asserted to request a reset. The intention is to force a large system reset of all major components except for debug. The C_HALT bit in the DHCSR is cleared as a result of the system reset requested. The debugger does not lose contact with the device.</description>
              <name>SYSRESETREQ</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Clears all active state information for fixed and configurable exceptions. This bit: is self-clearing, can only be set by the DAP when the core is halted.  When set: clears all active exception status of the processor, forces a return to Thread mode, forces an IPSR of 0. A debugger must re-initialize the stack.</description>
              <name>VECTCLRACTIVE</name>
            </field>
          </fields>
          <name>AIRCR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed10</addressOffset>
          <description>System Control Register. Use the System Control Register for power-management functions: signal to the system when the processor can enter a low power state, control how the processor enters and exits low power states.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Send Event on Pending bit:\n
                0 = Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded.\n
                1 = Enabled events and all interrupts, including disabled interrupts, can wakeup the processor.\n
                When an event or interrupt becomes pending, the event signal wakes up the processor from WFE. If the\n
                processor is not waiting for an event, the event is registered and affects the next WFE.\n
                The processor also wakes up on execution of an SEV instruction or an external event.</description>
              <name>SEVONPEND</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Controls whether the processor uses sleep or deep sleep as its low power mode:\n
                0 = Sleep.\n
                1 = Deep sleep.</description>
              <name>SLEEPDEEP</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Indicates sleep-on-exit when returning from Handler mode to Thread mode:\n
                0 = Do not sleep when returning to Thread mode.\n
                1 = Enter sleep, or deep sleep, on return from an ISR to Thread mode.\n
                Setting this bit to 1 enables an interrupt driven application to avoid returning to an empty main application.</description>
              <name>SLEEPONEXIT</name>
            </field>
          </fields>
          <name>SCR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed14</addressOffset>
          <description>The Configuration and Control Register permanently enables stack alignment and causes unaligned accesses to result in a Hard Fault.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <description>Always reads as one, indicates 8-byte stack alignment on exception entry. On exception entry, the processor uses bit[9] of the stacked PSR to indicate the stack alignment. On return from the exception it uses this stacked bit to restore the correct stack alignment.</description>
              <name>STKALIGN</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <description>Always reads as one, indicates that all unaligned accesses generate a HardFault.</description>
              <name>UNALIGN_TRP</name>
            </field>
          </fields>
          <name>CCR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed1c</addressOffset>
          <description>System handlers are a special class of exception handler that can have their priority set to any of the priority levels. Use the System Handler Priority Register 2 to set the priority of SVCall.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:30]</bitRange>
              <description>Priority of system handler 11, SVCall</description>
              <name>PRI_11</name>
            </field>
          </fields>
          <name>SHPR2</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed20</addressOffset>
          <description>System handlers are a special class of exception handler that can have their priority set to any of the priority levels. Use the System Handler Priority Register 3 to set the priority of PendSV and SysTick.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:30]</bitRange>
              <description>Priority of system handler 15, SysTick</description>
              <name>PRI_15</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[23:22]</bitRange>
              <description>Priority of system handler 14, PendSV</description>
              <name>PRI_14</name>
            </field>
          </fields>
          <name>SHPR3</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed24</addressOffset>
          <description>Use the System Handler Control and State Register to determine or clear the pending status of SVCall.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>Reads as 1 if SVCall is Pending.  Write 1 to set pending SVCall, write 0 to clear pending SVCall.</description>
              <name>SVCALLPENDED</name>
            </field>
          </fields>
          <name>SHCSR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed90</addressOffset>
          <description>Read the MPU Type Register to determine if the processor implements an MPU, and how many regions the MPU supports.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[23:16]</bitRange>
              <description>Instruction region. Reads as zero as ARMv6-M only supports a unified MPU.</description>
              <name>IREGION</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:8]</bitRange>
              <description>Number of regions supported by the MPU.</description>
              <name>DREGION</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Indicates support for separate instruction and data address maps. Reads as 0 as ARMv6-M only supports a unified MPU.</description>
              <name>SEPARATE</name>
            </field>
          </fields>
          <name>MPU_TYPE</name>
          <resetValue>0x00000800</resetValue>
        </register>
        <register>
          <addressOffset>0xed94</addressOffset>
          <description>Use the MPU Control Register to enable and disable the MPU, and to control whether the default memory map is enabled as a background region for privileged accesses, and whether the MPU is enabled for HardFaults and NMIs.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Controls whether the default memory map is enabled as a background region for privileged accesses. This bit is ignored when ENABLE is clear.\n
                0 = If the MPU is enabled, disables use of the default memory map. Any memory access to a location not\n
                covered by any enabled region causes a fault.\n
                1 = If the MPU is enabled, enables use of the default memory map as a background region for privileged software accesses.\n
                When enabled, the background region acts as if it is region number -1. Any region that is defined and enabled has priority over this default map.</description>
              <name>PRIVDEFENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Controls the use of the MPU for HardFaults and NMIs. Setting this bit when ENABLE is clear results in UNPREDICTABLE behaviour.\n
                When the MPU is enabled:\n
                0 = MPU is disabled during HardFault and NMI handlers, regardless of the value of the ENABLE bit.\n
                1 = the MPU is enabled during HardFault and NMI handlers.</description>
              <name>HFNMIENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enables the MPU. If the MPU is disabled, privileged and unprivileged accesses use the default memory map.\n
                0 = MPU disabled.\n
                1 = MPU enabled.</description>
              <name>ENABLE</name>
            </field>
          </fields>
          <name>MPU_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed98</addressOffset>
          <description>Use the MPU Region Number Register to select the region currently accessed by MPU_RBAR and MPU_RASR.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <description>Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers.\n
                The MPU supports 8 memory regions, so the permitted values of this field are 0-7.</description>
              <name>REGION</name>
            </field>
          </fields>
          <name>MPU_RNR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xed9c</addressOffset>
          <description>Read the MPU Region Base Address Register to determine the base address of the region identified by MPU_RNR. Write to update the base address of said region or that of a specified region, with whose number MPU_RNR will also be updated.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Base address of the region.</description>
              <name>ADDR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>On writes, indicates whether the write must update the base address of the region identified by the REGION field, updating the MPU_RNR to indicate this new region.\n
                Write:\n
                0 = MPU_RNR not changed, and the processor:\n
                Updates the base address for the region specified in the MPU_RNR.\n
                Ignores the value of the REGION field.\n
                1 = The processor:\n
                Updates the value of the MPU_RNR to the value of the REGION field.\n
                Updates the base address for the region specified in the REGION field.\n
                Always reads as zero.</description>
              <name>VALID</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <description>On writes, specifies the number of the region whose base address to update provided VALID is set written as 1. On reads, returns bits [3:0] of MPU_RNR.</description>
              <name>REGION</name>
            </field>
          </fields>
          <name>MPU_RBAR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0xeda0</addressOffset>
          <description>Use the MPU Region Attribute and Size Register to define the size, access behaviour and memory type of the region identified by MPU_RNR, and enable that region.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <description>The MPU Region Attribute field. Use to define the region attribute control.\n
                28 = XN: Instruction access disable bit:\n
                0 = Instruction fetches enabled.\n
                1 = Instruction fetches disabled.\n
                26:24 = AP: Access permission field\n
                18 = S: Shareable bit\n
                17 = C: Cacheable bit\n
                16 = B: Bufferable bit</description>
              <name>ATTRS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:8]</bitRange>
              <description>Subregion Disable. For regions of 256 bytes or larger, each bit of this field controls whether one of the eight equal subregions is enabled.</description>
              <name>SRD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:1]</bitRange>
              <description>Indicates the region size. Region size in bytes = 2^(SIZE+1). The minimum permitted value is 7 (b00111) = 256Bytes</description>
              <name>SIZE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enables the region.</description>
              <name>ENABLE</name>
            </field>
          </fields>
          <name>MPU_RASR</name>
          <resetValue>0x00000000</resetValue>
        </register>
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
  </peripherals>
</device>